app/Controllers/Admin.php

SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
SELECT *
FROM `events`
SELECT *
FROM `reviews`
SELECT *
FROM `register`
---
    public function index()
    {
        $users = $this->userModel
            ->findAll();

        $events = $this->eventModel
            ->findAll();

        $reviews = $this->reviewModel
            ->findAll();

        $register = $this->registerEventModel
            ->findAll();

SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
---
    public function users()
    {
        $users = $this->userModel
            ->findAll();

SELECT *
FROM `events`
---
    public function events()
    {
        if (in_groups('admin')) {

            $events = $this->eventModel
                ->findAll();

SELECT *
FROM `events`
WHERE `active` = 0
---
    public function added_events()
    {
        if (in_groups('admin')) {
            $events = $this->eventModel
                ->where('active', 0)
                ->findAll();

SELECT *
FROM `reviews`
---
    public function reviews()
    {
        $reviews = $this->reviewModel
            ->findAll();