app/Controllers/Events.php

SELECT *
FROM `events`
SELECT `type`
FROM `register`
WHERE `event_id` = '21'
AND `user_id` = '17'
 LIMIT 1
---
    public function index()
    {
        $events = $this->eventModel
            ->findAll();

        foreach ($events as $event) {
            $event->user = $this->userModel->getUserById($event->user_id);

            if (logged_in()) {
                $event->subscribe = $this->registerModel
                    ->select('type')
                    ->where('event_id', $event->id)
                    ->where('user_id', user()->id)
                    ->first();