app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `id` = '13'
AND `users`.`deleted_at` IS NULL
 LIMIT 1
---
    public function getUserById($userId)
    {
        return $this->where('id', $userId)->first();